

/*
*	三级联动 js版
*/


function Dsy(){
	this.Items = {};
}
Dsy.prototype.add = function(id,iArray){
	this.Items[id] = iArray;
}
Dsy.prototype.Exists = function(id){
	if(typeof(this.Items[id]) == "undefined") return false;
	return true;
}

function change(v){
	var str="0";
	for(i=0;i<v;i++){
		str+=("_"+(document.getElementById(s[i]).selectedIndex-1));
	};
	var ss=document.getElementById(s[v]);
	with(ss){
		length = 0;
		options[0]=new Option(opt0[v],opt0[v]);
		if(v && document.getElementById(s[v-1]).selectedIndex>0 || !v){
			if(dsy.Exists(str)){
				ar = dsy.Items[str];
				for(i=0;i<ar.length;i++){
					options[length]=new Option(ar[i],ar[i]);
				}//end for
				if(v){ options[0].selected = true; }
			}
		}//end if v
		if(++v<s.length){change(v);}
	}//End with
}

var dsy = new Dsy();

dsy.add("0",["机械工程学院","电子信息与电气工程学院","计算机科学与信息工程学院","土木与建筑工程学院","化学与环境工程学院","生物与食品工程学院","经济管理学院","文法学院","外国语学院","艺术设计学院","数理学院","飞行学院","国际教育学院"]);
dsy.add("0_0",["机械设计制造及其自动化（本科）","材料成型及控制工程（本科）","汽车服务工程（本科）","机械电子工程（本科）","工业设计（本科）","机电一体化技术（专科"]);
dsy.add("0_0_0",["1","2"]);
dsy.add("0_0_1",["1","2"]);
dsy.add("0_0_2",["1","2"]);
dsy.add("0_0_3",["1","2"]);
dsy.add("0_0_4",["1","2"]);
dsy.add("0_0_5",["1","2"]);

dsy.add("0_1",["自动化专业（本科）","电气工程及其自动化专业（本科）","电子信息工程专业（本科）","通信工程专业（本科）","电气自动化技术（专科）"]);
dsy.add("0_1_0",["1","2"]);
dsy.add("0_1_1",["1","2"]);
dsy.add("0_1_2",["1","2"]);
dsy.add("0_1_3",["1","2"]);
dsy.add("0_1_4",["1","2"]);
dsy.add("0_1_5",["1","2"]);
dsy.add("0_1_6",["1","2"]);

dsy.add("0_2",["计算机科学与技术（本科）","网络工程（本科）","软件工程（本科）","物联网工程（本科）","软件技术（专科）","计算机应用技术（专科）","网络技术（专科）","动漫设计与制作（专科）"]);
dsy.add("0_2_0",["1","2"]);
dsy.add("0_2_1",["1","2"]);
dsy.add("0_2_2",["1","2"]);
dsy.add("0_2_3",["1","2"]);
dsy.add("0_2_4",["1","2"]);
dsy.add("0_2_5",["1","2"]);
dsy.add("0_2_6",["1","2"]);

dsy.add("0_3",["土木工程（本科）","工程管理（本科）","城乡规划（本科）","建筑学（本科）","建筑工程技术专业（专科）"]);
dsy.add("0_3_0",["1","2"]);
dsy.add("0_3_1",["1","2"]);
dsy.add("0_3_2",["1","2"]);
dsy.add("0_3_3",["1","2"]);
dsy.add("0_3_4",["1","2"]);

dsy.add("0_4",["应用化学（本科）","化学工程与工艺（本科）","环境工程（本科）","高分子材料与工程专业（本科）","有机化工生产技术专业（专科）"]);
dsy.add("0_4_0",["1","2"]);
dsy.add("0_4_1",["1","2"]);
dsy.add("0_4_2",["1","2"]);
dsy.add("0_4_3",["1","2"]);
dsy.add("0_4_4",["1","2"]);

dsy.add("0_5",["生物工程学院"]);
dsy.add("0_5_0",[]);

dsy.add("0_6",["电子商务（本科）","信息管理与信息系统（本科）","国际贸易（本科）","财务管理（本科）","会计学（本科）","市场营销（本科）","工商管理（本科）","会计电算化专业（专科）"]);
dsy.add("0_6_0",["1","2"]);
dsy.add("0_6_1",["1","2"]);
dsy.add("0_6_2",["1","2"]);
dsy.add("0_6_3",["1","2"]);
dsy.add("0_6_4",["1","2"]);
dsy.add("0_6_5",["1","2"]);
dsy.add("0_6_6",["1","2"]);
dsy.add("0_6_7",["1","2"]);

dsy.add("0_7",["广播电视编导专业（本科）","播音与主持艺术专业（本科）","社会工作专业（本科）","知识产权专业（本科）","新闻采编与制作专业（专科）"]);
dsy.add("0_7_0",["1","2"]);
dsy.add("0_7_1",["1","2"]);
dsy.add("0_7_2",["1","2"]);
dsy.add("0_7_3",["1","2"]);
dsy.add("0_7_4",["1","2"]);


dsy.add("0_8",["英语专业（本科）","英语（专升本）","应用英语（专科）"]);
dsy.add("0_8_0",[]);

dsy.add("0_9",["艺术设计学院"]);
dsy.add("0_9_0",["1","2"]);

dsy.add("0_10",["信息与计算科学专业","应用物理"]);
dsy.add("0_10_0",["1","2"]);
dsy.add("0_10_1",["1","2"]);

dsy.add("0_11",["物流管理专业","交通运输专业（民航电子电气工程方向）","交通运输专业（民航机务工程方向）","飞行技术专业"]);
dsy.add("0_11_0",["1","2"]);
dsy.add("0_11_1",["1","2"]);
dsy.add("0_11_2",["1","2"]);
dsy.add("0_11_3",["1","2"]);

dsy.add("0_12",["土木工程专业"]);
dsy.add("0_12_0",["1","2"]);




var s=["s_Department","s_majon","s_class"];//三个select的name
var opt0 = ["院系","专业","班级"];//初始值
function _init_area(){  //初始化函数
	for(i=0;i<s.length-1;i++){
	  document.getElementById(s[i]).onchange=new Function("change("+(i+1)+")");
	}
	change(0);
}
